tutorials/incompressibleFluid/ductSecondaryFlow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwindV limited;

    turbulence          bounded Gauss linearUpwind limited;
    div(phi,k)          $turbulence;
    div(phi,epsilon)    $turbulence;
    div(phi,R)          $turbulence;

    div(dev(R))         Gauss linear;
    div(devTau)         Gauss linear;
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
    div((nu*dev(T(grad(U)))))  Gauss linear;
    div((nu*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}


// ************************************************************************* //
